<!-- add-pr-comment:eks_plan -->

# production/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_alb_target_group.public_nginx_http will be created
  + resource "aws_alb_target_group" "public_nginx_http" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "notification-public-nginx-http"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "ca-central-1"
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0e02e0295db594518"
      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "404"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
      + stickiness (known after apply)
      + target_failover (known after apply)
      + target_group_health (known after apply)
      + target_health_state (known after apply)
    }
  # aws_iam_policy.cert_manager_route53_dns01 will be created
  + resource "aws_iam_policy" "cert_manager_route53_dns01" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cert-manager-route53-dns01-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sts:AssumeRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::123456789012:role/cert-manager-dns01",
                        ]
                      + Sid      = "AssumeDnsRoleForAcme"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_role.cert_manager_route53 will be created
  + resource "aws_iam_role" "cert_manager_route53" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:cert-manager:cert-manager"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cert-manager-route53-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # aws_iam_role_policy_attachment.cert_manager_route53_dns01 will be created
  + resource "aws_iam_role_policy_attachment" "cert_manager_route53_dns01" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cert-manager-route53-eks-role"
    }
  # aws_lb_listener_rule.public-nginx-catchall-subdomains will be created
  + resource "aws_lb_listener_rule" "public-nginx-catchall-subdomains" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:listener/app/notification-production-alb/a88ef289ed9dd41e/105ea2f2a8a9b3fa"
      + priority     = 50000
      + region       = "ca-central-1"
      + tags_all     = (known after apply)
      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
      + condition {
          + host_header {
              + values = [
                  + "*.notification.canada.ca",
                ]
            }
        }
    }
  # aws_route53_record.wildcard-notification-canada-ca-cname will be created
  + resource "aws_route53_record" "wildcard-notification-canada-ca-cname" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.notification.canada.ca"
      + records         = [
          + "notification-production-alb-1685085140.ca-central-1.elb.amazonaws.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"
    }
  # aws_secretsmanager_secret.cert_manager_route53_irsa_role_arn will be created
  + resource "aws_secretsmanager_secret" "cert_manager_route53_irsa_role_arn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "CERT_MANAGER_ROUTE53_IRSA_ROLE_ARN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "ca-central-1"
      + tags_all                       = (known after apply)
      + replica (known after apply)
    }
  # aws_secretsmanager_secret.cert_manager_route53_role_arn will be created
  + resource "aws_secretsmanager_secret" "cert_manager_route53_role_arn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "CERT_MANAGER_ROUTE53_ROLE_ARN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "ca-central-1"
      + tags_all                       = (known after apply)
      + replica (known after apply)
    }
  # aws_secretsmanager_secret.cert_manager_route53_zone_id will be created
  + resource "aws_secretsmanager_secret" "cert_manager_route53_zone_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "CERT_MANAGER_ROUTE53_ZONE_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "ca-central-1"
      + tags_all                       = (known after apply)
      + replica (known after apply)
    }
  # aws_secretsmanager_secret.public_nginx_target_group_arn will be created
  + resource "aws_secretsmanager_secret" "public_nginx_target_group_arn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "PUBLIC_NGINX_TARGET_GROUP_ARN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "ca-central-1"
      + tags_all                       = (known after apply)
      + replica (known after apply)
    }
  # aws_secretsmanager_secret_version.cert_manager_route53_irsa_role_arn will be created
  + resource "aws_secretsmanager_secret_version" "cert_manager_route53_irsa_role_arn" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "ca-central-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }
  # aws_secretsmanager_secret_version.cert_manager_route53_role_arn will be created
  + resource "aws_secretsmanager_secret_version" "cert_manager_route53_role_arn" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "ca-central-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }
  # aws_secretsmanager_secret_version.cert_manager_route53_zone_id will be created
  + resource "aws_secretsmanager_secret_version" "cert_manager_route53_zone_id" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "ca-central-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }
  # aws_secretsmanager_secret_version.public_nginx_target_group_arn will be created
  + resource "aws_secretsmanager_secret_version" "public_nginx_target_group_arn" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "ca-central-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }
  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ (sensitive value),
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
        }
        # (30 unchanged attributes hidden)
        # (4 unchanged blocks hidden)
    }
Plan: 14 to add, 1 to change, 0 to destroy.

# --- End of Plan 1 ---

```